

function App() {

  // Идентификация 
  // Вопрос: Кто ты ? (Пример: ввести email или логин)

  // Аутентификация
  // Вопрос: Докажи, что это ты (Пример: ввести пароль или код из смс)

  // Авторизация
  // Вопрос: Что тебе можно? (Пример: Админ может удалять товары а покупатель нет)

  // Проблема:HTTP ничего не помнит
  // HTTP - протокол без состояния (stateless). Каждый запрос как первый для сервера. С каждым запросом нужно отправлять что-то, что докажет это я 
  // Есть для этого два основных подхода

  // Подход 1. Сессии (классика)
  // 1. Мы отправляем логин и пароль
  // 2. Сервер создает у себя запись "сессияNabc123 принадлежит Ивану" и хранит ее в своей базе или памяти
  // 3. Отдает браузеру cookie sessionId=abc123
  // 4. Браузер сам прикладывает эту cookie к каждому запросу. Сервер ищет сессию в своей базе и узнает вас 
  // Аналогия: Гардероб

  // Подход 2. Токены (JWT).
  // 1. Мы отправляем логин и пароль
  // 2. Сервер создает токен в который записано кто мы и подписывает его своим секретным ключом
  // 3. Сервер ничего у себя не хранит, просто отдает токен
  // 4. Клиент прикладывает токен к каждому запросу. Сервер проверяет подпись и читает данные прямо из токена
  // Аналогия: Браслет на фестивале

  // JWT (JSON Web Token) - строка из трех частей, разделенных точками
  // eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOjEsImlhdCI6MTcwMDAwMDAwMCwiZXhwIjoxNzAwMDAzNjAwfQ.4Xq7bJ3234n23n4n2jnjn2jn234jnj23jnj2
  
  // 1. Header - тип токена и алгоритм подписи { "alg": "HS256", "typ": "JWT" }
  // 2. Payload - данные, утверждения { "sub": 1, "iat": 170000000, "exp": 1700003600 }
  // 3. Signature - защита от подделки 

  // JWT не шифруется, не хранить в нем пароли, карты и другие важные данные

  // Зачем тогда подпись (signature) - Подпись не прячет данные, она гарантирует что их некто не менял

  // у JWT токена есть проблема: если токен украли им можно пользоваться до истечения срока, отозвать его сложно

  // GET /api/v1/auth/profile
  // Authorization: Bearer eyJhbsdfsljasdlEkwerj1ASKn89sf...

  // Swagger - веб страница которая показывает 

  // OpenApi - стандарт описания REST API какие есть адреса, какие методы, что отправлять а что получать
  // Swagger UI - веб страница которая показывает это описание

  return (
    <>

    </>
  )
}

export default App
